controllers/TestController.php

    public function actionDetail(){
        //为图片创建一个缩略图
//        Image::thumbnail('@webroot/test/images/phone.png', 120, 120)
//            ->save(Yii::getAlias('@runtime/thumb-test-image.jpg'), ['quality' => 50]);

        echo Yii::$app->request->url;
        echo $userIP = Yii::$app->request->userIP;
        $gid = 374;
        $goods = Goods::find()->where(['id' => $gid])->one();
---
SELECT * FROM `yii_goods` WHERE `id`=374

    public function actionTest(){
        //设置session_flash
        $session = yii::$app->session;
//        // 在名称为"alerts"的session_flash信息增加数据
//        $session->setFlash('alerts','first');
//        $session->addFlash('alerts', 'You have successfully deleted your post.');
//        $session->addFlash('alerts', 'You have successfully added a new friend.');
//        $session->addFlash('alerts', 'You are promoted.');
//        $alerts = $session->getFlash('alerts');
//        print_r($alerts);
        if($session->hasFlash('postDeleted')){
            $session->setFlash('postDeleted', 'You have successfully deleted your post.');
        }

        $cookies = Yii::$app->response->cookies;
        // 在要发送的响应中添加一个新的 cookie
        $cookies->add(new \yii\web\Cookie([
            'name' => 'language',
            'value' => 'zh-CN',
        ]));
        //获取cookie
        echo $cookies->getValue('language');

        //查询构建器
        $query = (new Query())->from('yii_login');
//        $a = $query->select(['*'])->all();
//        $command = $query->select(['*'])->where(['like', 'lname', ['23', '45']])->all(); //查询语句，数组方式
          $command = $query->select(['*'])->where(['like', 'lname', ['23', '45']])->indexBy(function ($row) {
              return $row['id'];//代表使用id，作为数组的下标(key)
          })->all(); //查询语句，索引方式
---
SELECT * FROM `yii_login` WHERE `lname` LIKE '%23%' AND `lname` LIKE '%45%'

            //使用分页
            $query = Login::find();
            // 得到文章的总数（但是还没有从数据库取数据）
            $count = $query->count();
---
SELECT COUNT(*) FROM `yii_login`